localization/pull.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd">
    <s:Header>
        <a:To>http://103040106:5985/wsman</a:To>
        <w:ResourceURI s:mustUnderstand="true">{resource_uri}</w:ResourceURI>
        <a:ReplyTo>
            <a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
        </a:ReplyTo>
        <a:Action s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/enumeration/Pull</a:Action>
        <w:MaxEnvelopeSize s:mustUnderstand="true">512000</w:MaxEnvelopeSize>
        <a:MessageID>uuid:578DC055-B6C4-4387-B39F-E992D0ED76A0</a:MessageID>
        <w:OperationTimeout>PT60.000S</w:OperationTimeout>
    </s:Header>
    <s:Body>
        <n:Pull>
            <n:EnumerationContext xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration">{enumeration_context}</n:EnumerationContext>
            <n:MaxElements>32000</n:MaxElements>
        </n:Pull>
    </s:Body>
</s:Envelope>
